schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
#include "common.h"
// clang-format off
/*****************************************************************************************************************************************************
    MiniWebRadio -- Webradio receiver for ESP32

    first release on 03/2017                                                                                                      */String Version ="\
    Version 3.01h  May 01/2024                                                                                                                       ";

/*  2.8" color display (320x240px) with controller ILI9341 or HX8347D (SPI) or
    3.5" color display (480x320px) wiht controller ILI9486 or ILI9488 (SPI)


    SD_MMC is mandatory
    IR remote is optional
    BT Transmitter is optional

*****************************************************************************************************************************************************/

// THE SOFTWARE IS PROVIDED "AS IS" FOR PRIVATE USE ONLY, IT IS NOT FOR COMMERCIAL USE IN WHOLE OR PART OR CONCEPT. FOR PERSONAL USE IT IS SUPPLIED
// WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
// AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHOR OR COPYRIGHT HOLDER BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF
// CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE

// clang-format on

// global variables

enum status {
    NONE = 0,
    RADIO = 1,
    PLAYER = 2,
    DLNA = 3,
    CLOCK = 4,
    BRIGHTNESS = 5,
    ALARM = 6,
    SLEEP = 7,
    STATIONSLIST = 8,
    AUDIOFILESLIST = 9,
    DLNAITEMSLIST = 10,
    BLUETOOTH = 11,
    EQUALIZER = 12,
    UNDEFINED = 255
};

char _hl_item[16][40]{"",                 // none
                      "Internet Radio",   // "* интернет-радио *"  "ραδιόφωνο Internet"
                      "Audio player",     // "** цифрово́й плеер **
                      "DLNA",             // Digital Living Network Alliance
                      "Clock",            // Clock "** часы́ **"  "** ρολόι **"
                      "Brightness",       // Brightness яркость λάμψη
                      "Alarm (hh:mm)",    // Alarm
                      "Off Timer (h:mm)", // "Sleeptimer" "Χρονομετρητής" "Таймер сна"
                      "Stations List",
                      "Audio Files",
                      "DLNA List",
                      "Bluetooth",
                      "Equalizer",
                      "",
                      ""
                      ""};

const uint8_t       _max_volume = 21;
const uint16_t      _max_stations = 1000;
int16_t             _releaseNr = -1;
int8_t              _currDLNAsrvNr = -1;
uint8_t             _alarmdays = 0;
uint8_t             _cur_volume = 0;           // will be set from stored preferences
uint8_t             _ringvolume = _max_volume; //
uint8_t             _brightness = 0;
uint8_t             _state = UNDEFINED;  // statemaschine
uint8_t             _commercial_dur = 0; // duration of advertising
uint8_t             _cur_Codec = 0;
uint8_t             _numServers = 0; //
uint8_t             _level = 0;
uint8_t             _timeFormat = 24; // 24 or 12
uint8_t             _staListPos = 0;
uint8_t             _semaphore = 0;
uint8_t             _reconnectCnt = 0;
uint16_t            _staListNr = 0;
uint8_t             _fileListPos = 0;
uint8_t             _radioSubmenue = 0;
uint8_t             _playerSubmenue = 0;
uint8_t             _clockSubMenue = 0;
uint16_t            _fileListNr = 0;
uint8_t             _itemListPos = 0; // DLNA items
uint16_t            _dlnaItemNr = 0;
uint8_t             _dlnaLevel = 0;
int8_t              _rssi_bt = -127;
int16_t             _alarmtime[7] = {0};  // in minutes (23:59 = 23 *60 + 59) [0] Sun, [1] Mon
int16_t             _toneLP = 0;          // -40 ... +6 (dB)        audioI2S
int16_t             _toneBP = 0;          // -40 ... +6 (dB)        audioI2S
int16_t             _toneHP = 0;          // -40 ... +6 (dB)        audioI2S
int16_t             _toneBAL = 0;         // -16...0....+16         audioI2S
uint16_t            _icyBitRate = 0;      // from http response header via event
uint16_t            _avrBitRate = 0;      // from decoder via getBitRate(true)
uint16_t            _cur_station = 0;     // current station(nr), will be set later
uint16_t            _cur_AudioFileNr = 0; // position inside _SD_content
uint16_t            _sleeptime = 0;       // time in min until MiniWebRadio goes to sleep
uint16_t            _sum_stations = 0;
uint16_t            _plsCurPos = 0;
uint16_t            _totalNumberReturned = 0;
uint16_t            _dlnaMaxItems = 0;
uint32_t            _resumeFilePos = 0; //
uint32_t            _playlistTime = 0;  // playlist start time millis() for timeout
uint32_t            _settingsHash = 0;
uint32_t            _audioFileSize = 0;
uint32_t            _media_downloadPort = 0;
uint32_t            _audioCurrentTime = 0;
uint32_t            _audioFileDuration = 0;
uint8_t             _resetResaon = (esp_reset_reason_t)ESP_RST_UNKNOWN;
const char*         _pressBtn[8];
const char*         _releaseBtn[8];
char                _chbuf[512];
char                _fName[256];
char                _myIP[25] = {0};
char                _path[128];
char                _prefix[5] = "/s";
char                _commercial[25];
char                _icyDescription[512] = {};
char                _streamTitle[512] = {};
char*               _curAudioFolder = NULL;
char*               _lastconnectedfile = NULL;
char*               _stationURL = NULL;
char*               _JSONstr = NULL;
char*               _BT_metaData = NULL;
char*               _playlistPath = NULL;
bool                _f_rtc = false; // true if time from ntp is received
bool                _f_100ms = false;
bool                _f_1sec = false;
bool                _f_10sec = false;
bool                _f_1min = false;
bool                _f_mute = false;
bool                _f_muteIsPressed = false;
bool                _f_sleeping = false;
bool                _f_isWebConnected = false;
bool                _f_isFSConnected = false;
bool                _f_eof = false;
bool                _f_reconnect = false;
bool                _f_eof_alarm = false;
bool                _f_alarm = false;
bool                _f_irNumberSeen = false;
bool                _f_newIcyDescription = false;
bool                _f_newStreamTitle = false;
bool                _f_newBitRate = false;
bool                _f_newLogoAndStation = false;
bool                _f_newCommercial = false;
bool                _f_volBarVisible = false;
bool                _f_switchToClock = false;    // jump into CLOCK mode at the next opportunity
bool                _f_hpChanged = false;        // true, if HeadPhone is plugged or unplugged
bool                _f_timeAnnouncement = false; // time announcement every full hour
bool                _f_playlistEnabled = false;
bool                _f_playlistNextFile = false;
bool                _f_logoUnknown = false;
bool                _f_pauseResume = false;
bool                _f_accessPoint = false;
bool                _f_SD_Upload = false;
bool                _f_PSRAMfound = false;
bool                _f_FFatFound = false;
bool                _f_SD_MMCfound = false;
bool                _f_ESPfound = false;
bool                _f_clearLogo = false;
bool                _f_clearStationName = false;
bool                _f_shuffle = false;
bool                _f_dlnaBrowseServer = false;
bool                _f_dlnaWaitForResponse = false;
bool                _f_dlnaSeekServer = false;
bool                _f_BtEmitterFound = false;
bool                _f_BTEmitterConnected = false;
bool                _f_brightnessIsChangeable = false;
String              _station = "";
String              _stationName_nvs = "";
char*               _stationName_air = NULL;
String              _homepage = "";
String              _filename = "";
String              _lastconnectedhost = "";
String              _scannedNetworks = "";
String              _TZName = "Europe/Berlin";
String              _TZString = "CET-1CEST,M3.5.0,M10.5.0/3";
String              _media_downloadIP = "";
dlnaHistory         _dlnaHistory[10];
timecounter         _timeCounter;
SD_content          _SD_content;
std::vector<char*>  _PLS_content;

const char* codecname[10] = {"unknown", "WAV", "MP3", "AAC", "M4A", "FLAC", "AACP", "OPUS", "OGG", "VORBIS"};


Preferences    pref;
Preferences    stations;
WebSrv         webSrv;
WiFiMulti      wifiMulti;
RTIME          rtc;
Ticker         ticker100ms;
IR             ir(IR_PIN); // do not change the objectname, it must be "ir"
TP             tp(TP_CS, TP_IRQ);
File           audioFile;
FtpServer      ftpSrv;
WiFiClient     client;
WiFiUDP        udp;
DLNA_Client    dlna;
KCX_BT_Emitter bt_emitter(BT_EMITTER_RX, BT_EMITTER_TX, BT_EMITTER_LINK, BT_EMITTER_MODE);

