schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
/*****************************************************************************************************************************************************
 *                                                                     P L A Y L I S T                                                               *
 *****************************************************************************************************************************************************/

bool preparePlaylistFromFile(const char* path) {
    File playlistFile = SD_MMC.open(path);
    if(!playlistFile) {
        log_e("playlistfile path not found");
        return false;
    }

    if(playlistFile.size() > 1048576) {
        log_e("Playlist too big, size > 1MB");
        playlistFile.close();
        return false;
    }
    if(_playlistPath) {
        free(_playlistPath);
        _playlistPath = NULL;
    }
    vector_clear_and_shrink(_PLS_content); // clear _PLS_content first
    char* buff1 = x_ps_malloc(2024);
    char* buff2 = x_ps_malloc(1048);
    if(!buff1 || !buff2) {
        log_e("oom");
        playlistFile.close();
        return false;
    }
    size_t bytesRead = 0;
    bool   f_EXTINF_seen = false;

    while(playlistFile.available() > 0) {
        bytesRead = playlistFile.readBytesUntil('\n', buff1, 1024);
        if(bytesRead < 5) continue; // line is # or space or nothing, smallest filename "1.mp3" < 5
        buff1[bytesRead] = '\0';
        trim(buff1);
        if(startsWith(buff1, "#EXTM3U")) continue;
        if(startsWith(buff1, "#EXTINF:")) { // #EXTINF:8,logo-1.mp3
            strcpy(buff2, buff1 + 8);
            f_EXTINF_seen = true;
            continue;
        }
        if(startsWith(buff1, "#")) continue; // all other lines
        if(f_EXTINF_seen) {
            f_EXTINF_seen = false;
            strcat(buff1, "\n");
            strcat(buff1, buff2);
        }
        _PLS_content.push_back(x_ps_strdup((const char*)buff1));
    }
    _playlistPath = strdup(playlistFile.path());
    int idx = lastIndexOf((const char*)_playlistPath, '/');
    if(idx < 0) log_e("wrong playlist path");
    _playlistPath[idx] = '\0';
    playlistFile.close();
    if(buff1) {
        free(buff1);
        buff1 = NULL;
    }
    if(buff2) {
        free(buff2);
        buff2 = NULL;
    }
    return true;
}
//____________________________________________________________________________________________________________________________________________________

bool preparePlaylistFromFolder(const char* path) { // all files whithin a folder
    if(!SD_MMC.exists(path)) {
        SerialPrintfln(ANSI_ESC_RED "SD_MMC/%s not exist", path);
        return false;
    }
    File folder = SD_MMC.open(path);
    if(!folder.isDirectory()) {
        SerialPrintfln(ANSI_ESC_RED "SD_MMC/%s is not a directory", path);
        folder.close();
        return false;
    }
    vector_clear_and_shrink(_PLS_content); // clear _PLS_content first

    while(true) { // get content
        File file = folder.openNextFile();
        if(!file) break;
        if(file.isDirectory()) continue;
        if(isAudio(file)) { _PLS_content.push_back(x_ps_strdup((const char*)file.path())); }
        file.close();
    }
    folder.close();

    for(int i = 0; i < _PLS_content.size(); i++) {
        if(_PLS_content[i][0] == 2) { // remove ASCII 2
            memcpy(_PLS_content[i], _PLS_content[i] + 1, strlen(_PLS_content[i]));
        }
    }

    if(_f_shuffle) sortPlayListRandom();
    else sortPlayListAlphabetical();

    return true;
}
//____________________________________________________________________________________________________________________________________________________

void sortPlayListAlphabetical() {
    for(int i = 0; i < _PLS_content.size(); i++) { // easy bubble sort
        for(int j = 1; j < _PLS_content.size(); j++) {
            if(strcmp(_PLS_content[j - 1], _PLS_content[i]) > 0) { swap(_PLS_content[i], _PLS_content[j - 1]); }
        }
    }
}
//____________________________________________________________________________________________________________________________________________________

void sortPlayListRandom() {
    for(int i = 0; i < _PLS_content.size(); i++) { // easy bubble sort
        uint16_t randIndex = random(0, _PLS_content.size());
        swap(_PLS_content[i], _PLS_content[randIndex]); // swapping the values
    }
}
//____________________________________________________________________________________________________________________________________________________

void processPlaylist(boolean first) {
    if(_PLS_content.size() == 0) {
        log_e("playlist is empty");
        return;
    } // guard
    int16_t idx = 0;
    boolean f_has_EXTINF = false;
    if(first) {
        _plsCurPos = 0;
        _f_playlistEnabled = true;
    }

    if(_plsCurPos == _PLS_content.size()) goto exit;

    _playerSubmenue = 1;
    if(_state != PLAYER) changeState(PLAYER);

    // now read from vector _PLS_content

    idx = indexOf(_PLS_content[_plsCurPos], "\n", 0);
    if(idx > 0) { // has additional infos: duration, title
        f_has_EXTINF = true;
        int16_t idx1 = indexOf(_PLS_content[_plsCurPos], ",", idx);
        SerialPrintfln("Playlist:    " ANSI_ESC_GREEN "Title: %s", _PLS_content[_plsCurPos] + idx1 + 1);
        clearLogo();
        showFileName(_PLS_content[_plsCurPos] + idx1 + 1);
        int8_t len = idx1 - (idx + 1);
        if(len > 0 && len < 6) { // song playtime
            char tmp[7] = {0};
            memcpy(tmp, _PLS_content[_plsCurPos] + idx + 1, len);
            tmp[len] = '\0';
            SerialPrintfln("Playlist:    " ANSI_ESC_GREEN "playtime: %is", atoi(tmp));
        }
        _PLS_content[_plsCurPos][idx] = '\0';
    }
    if(startsWith(_PLS_content[_plsCurPos], "http")) {
        SerialPrintflnCut("Playlist:    ", ANSI_ESC_YELLOW, _PLS_content[_plsCurPos]);
        showVolumeBar();
        if(!f_has_EXTINF) clearLogoAndStationname();
        webSrv.send("SD_playFile=", _PLS_content[_plsCurPos]);
        _cur_Codec = 0;
        connecttohost(_PLS_content[_plsCurPos]);
    }
    else if(startsWith(_PLS_content[_plsCurPos], "file://")) { // root
        urldecode(_PLS_content[_plsCurPos]);
        SerialPrintfln("Playlist:    " ANSI_ESC_YELLOW "%s", _PLS_content[_plsCurPos] + 7);
        webSrv.send("SD_playFile=", _PLS_content[_plsCurPos] + 7);
        SD_playFile(_PLS_content[_plsCurPos] + 7, 0, false);
    }
    else {
        urldecode(_PLS_content[_plsCurPos]);
        char* playFile = NULL;
        if(_playlistPath) { // path of m3u file
            playFile = x_ps_malloc(strlen(_playlistPath) + strlen(_PLS_content[_plsCurPos]) + 5);
            strcpy(playFile, _playlistPath);
            if(_PLS_content[_plsCurPos][0] != '/') strcat(playFile, "/");
            strcat(playFile, _PLS_content[_plsCurPos]);
        }
        else { // have no playlistpath
            playFile = x_ps_malloc(strlen(_PLS_content[_plsCurPos]) + 5);
            strcpy(playFile, _PLS_content[_plsCurPos]);
        }
        SerialPrintfln("Playlist:    " ANSI_ESC_YELLOW "%s", playFile);
        webSrv.send("SD_playFile=", playFile);
        if(f_has_EXTINF) SD_playFile(playFile, 0, false);
        else SD_playFile(playFile, 0, true);
        if(playFile) {
            free(playFile);
            playFile = NULL;
        }
    }
    _plsCurPos++;
    showPlsFileNumber();
    return;

