schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    btn_BR_ready.begin(   2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BR_ready.setDefaultPicturePath("/btn/Button_Ready_Blue.jpg");
                                                                                         btn_BR_ready.setClickedPicturePath("/btn/Button_Ready_Yellow.jpg");
    pic_BR_logo.begin(    0,  _winName.y) ;                                              pic_BR_logo.setPicturePath("/common/Brightness.jpg");
    // EQUALIZER ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    sdr_EQ_lowPass.begin(  _sdrLP.x,  _sdrLP.y,  _sdrLP.w,  _sdrLP.h, -40,  6);          sdr_EQ_lowPass.setValue(_toneLP);
    sdr_EQ_bandPass.begin( _sdrBP.x,  _sdrBP.y,  _sdrBP.w,  _sdrBP.h, -40,  6);          sdr_EQ_bandPass.setValue(_toneBP);
    sdr_EQ_highPass.begin( _sdrHP.x,  _sdrHP.y,  _sdrHP.w,  _sdrHP.h, -40,  6);          sdr_EQ_highPass.setValue(_toneHP);
    sdr_EQ_balance.begin( _sdrBAL.x, _sdrBAL.y, _sdrBAL.w, _sdrBAL.h, -16, 16);          sdr_EQ_balance.setValue(_toneBAL);
    txt_EQ_lowPass.begin(  _sdrLP.x +  _sdrLP.w + 2,  _sdrLP.y, 80, _sdrLP.h);           txt_EQ_lowPass.setFont(_fonts[2]);
    txt_EQ_bandPass.begin( _sdrBP.x +  _sdrBP.w + 2,  _sdrBP.y, 80, _sdrBP.h);           txt_EQ_bandPass.setFont(_fonts[2]);
    txt_EQ_highPass.begin( _sdrHP.x +  _sdrHP.w + 2,  _sdrHP.y, 80, _sdrHP.h);           txt_EQ_highPass.setFont(_fonts[2]);
    txt_EQ_balance.begin( _sdrBAL.x + _sdrBAL.w + 2, _sdrBAL.y, 80, _sdrBAL.h);          txt_EQ_balance.setFont(_fonts[2]);
    btn_EQ_lowPass.begin( _sdrLP.x - 60, _sdrLP.y + 1, 48, 48);                          btn_EQ_lowPass.setDefaultPicturePath("/btn/LP_green.jpg");
                                                                                         btn_EQ_lowPass.setClickedPicturePath("/btn/LP_yellow.jpg");
    btn_EQ_bandPass.begin(_sdrBP.x - 60, _sdrBP.y + 1, 48, 48);                          btn_EQ_bandPass.setDefaultPicturePath("/btn/BP_green.jpg");
                                                                                         btn_EQ_bandPass.setClickedPicturePath("/btn/BP_yellow.jpg");
    btn_EQ_highPass.begin(_sdrHP.x - 60, _sdrHP.y + 1, 48, 48);                          btn_EQ_highPass.setDefaultPicturePath("/btn/HP_green.jpg");
                                                                                         btn_EQ_highPass.setClickedPicturePath("/btn/HP_yellow.jpg");
    btn_EQ_balance.begin(_sdrBAL.x - 60, _sdrBAL.y + 1, 48, 48);                         btn_EQ_balance.setDefaultPicturePath("/btn/BAL_green.jpg");
                                                                                         btn_EQ_balance.setClickedPicturePath("/btn/BAL_yellow.jpg");
    btn_EQ_Radio.begin(   0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_EQ_Radio.setDefaultPicturePath("/btn/Radio_Green.jpg");
                                                                                         btn_EQ_Radio.setClickedPicturePath("/btn/Radio_Yellow.jpg");
    btn_EQ_Player.begin(  1 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_EQ_Player.setDefaultPicturePath("/btn/Player_Green.jpg");
                                                                                         btn_EQ_Player.setClickedPicturePath("/btn/Player_Yellow.jpg");
    btn_EQ_Mute.begin(    2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_EQ_Mute.setOffPicturePath("/btn/Button_Mute_Green.jpg");
                                                                                         btn_EQ_Mute.setOnPicturePath("/btn/Button_Mute_Red.jpg");
                                                                                         btn_EQ_Mute.setClickedOffPicturePath("/btn/Button_Mute_Yellow.jpg");
                                                                                         btn_EQ_Mute.setClickedOnPicturePath("/btn/Button_Mute_Yellow.jpg");
                                                                                         btn_EQ_Mute.setValue(_f_mute);
    // BLUETOOTH ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    btn_BL_volDown.begin( 0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BL_volDown.setDefaultPicturePath("/btn/Button_Volume_Down_Blue.jpg");
                                                                                         btn_BL_volDown.setClickedPicturePath("/btn/Button_Volume_Down_Yellow.jpg");
    btn_BL_volUp.begin(   1 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BL_volUp.setDefaultPicturePath("/btn/Button_Volume_Up_Blue.jpg");
                                                                                         btn_BL_volUp.setClickedPicturePath("/btn/Button_Volume_Up_Yellow.jpg");
    btn_BL_pause.begin(   2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BL_pause.setOffPicturePath("/btn/Button_Pause_Blue.jpg");
                                                                                         btn_BL_pause.setOnPicturePath("/btn/Button_Right_Blue.jpg");
                                                                                         btn_BL_pause.setClickedOffPicturePath("/btn/Button_Pause_Yellow.jpg");
                                                                                         btn_BL_pause.setClickedOnPicturePath("/btn/Button_Right_Yellow.jpg");
    btn_BL_radio.begin(   3 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BL_radio.setDefaultPicturePath("/btn/Radio_Green.jpg");
                                                                                         btn_BL_radio.setClickedPicturePath("/btn/Radio_Yellow.jpg");
    pic_BL_mode.begin( _winLogo.x, _winLogo.y);                                          pic_BL_mode.setAlternativPicturePath("/common/BTnc.jpg");

    //pic_R_logo.begin(_winLogo.x, _winLogo.y);                                           pic_R_logo.setAlternativPicturePath("/common/unknown.jpg");
    //pic_R_logo.setPicturePath("/common/Brightness.jpg");
    //pic_R_logo.setPicturePath("/common/Night_Gown.bmp");
    //pic_R_logo.setPicturePath("/btn/PLAYER.gif");
}
// clang-format off

/*         ╔═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
           ║                                                                              C H A N G E    S T A T E                                                                       ║
           ╚═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

// clang-format on
void changeState(int32_t state){
//    log_i("new state %i, current state %i radioSubMenue %i", state, _state, _radioSubmenue);
    switch(_state){
        case RADIO:      btn_RA_Mute.disable();     btn_RA_volDown.disable();  btn_RA_volUp.disable();    btn_RA_prevSta.disable(); btn_RA_nextSta.disable();
                         btn_RA_staList.disable();  btn_RA_player.disable();   btn_RA_dlna.disable();     btn_RA_clock.disable();   btn_RA_sleep.disable();
                         btn_RA_bright.disable();   btn_RA_equal.disable();    pic_R_logo.disable();     btn_RA_bt.disable();
                         VUmeter_RA.disable(); break;
        case STATIONSLIST:
                         lst_RADIO.disable();
                         break;
        case PLAYER:     btn_PL_Mute.disable();     btn_PL_volDown.disable();  btn_PL_volUp.disable();    btn_PL_pause.disable();   btn_PL_cancel.disable();
                         btn_PL_prevFile.disable(); btn_PL_nextFile.disable(); btn_PL_ready.disable();    btn_PL_playAll.disable(); btn_PL_shuffle.disable();
                         btn_PL_fileList.hide();    btn_PL_radio.hide();
                         break;
        case AUDIOFILESLIST: lst_PLAYER.disable();
                         break;
        case DLNA:       btn_DL_Mute.disable();     btn_DL_volDown.disable();  btn_DL_volUp.disable();    btn_DL_pause.disable();   btn_DL_cancel.disable();
                         btn_DL_fileList.disable(); btn_DL_radio.disable();
                         break;
        case DLNAITEMSLIST: lst_DLNA.disable();
                         break;
        case CLOCK:      btn_CL_Mute.disable();     btn_CL_alarm.disable();    btn_CL_radio.disable();    btn_CL_volDown.disable(); btn_CL_volUp.disable();
                         clk_CL_green.disable();
                         break;
        case ALARM:      clk_AL_red.disable();      btn_AL_left.disable();     btn_AL_right.disable();    btn_AL_up.disable();      btn_AL_down.disable();
                         btn_AL_ready.disable();
                         break;
        case SLEEP:      btn_SL_up.disable();       btn_SL_down.disable();     btn_SL_ready.disable();    btn_SL_cancel.disable();
                         break;
        case BRIGHTNESS: btn_BR_left.disable();     btn_BR_right.disable();    btn_BR_ready.disable();    pic_BR_logo.disable();
                         break;
        case EQUALIZER:  sdr_EQ_lowPass.disable();  sdr_EQ_bandPass.disable(); sdr_EQ_highPass.disable(); sdr_EQ_balance.disable();
                         btn_EQ_lowPass.disable();  btn_EQ_bandPass.disable(); btn_EQ_highPass.disable(); btn_EQ_balance.disable(); btn_EQ_Radio.disable();
                         txt_EQ_lowPass.disable();  txt_EQ_bandPass.disable(); txt_EQ_highPass.disable(); txt_EQ_balance.disable(); btn_EQ_Player.disable();
                         btn_EQ_Mute.disable();
                         break;
    }
    _f_volBarVisible = false;
    if(_timeCounter.timer){
        _timeCounter.timer = 0;
        showFooterRSSI(true);
    }

    dispHeader.updateItem(_hl_item[state]);
    switch(state) {
        case RADIO:{
            if(_state != RADIO) clearWithOutHeaderFooter();
            if(_radioSubmenue == 0){
                VUmeter_RA.show();
                if(_state != RADIO) showLogoAndStationName();
                _f_newStreamTitle = true;
                _timeCounter.timer = 0;
            }
            if(_radioSubmenue == 1){
                clearTitle();
                showVolumeBar();
                btn_RA_Mute.show();      btn_RA_volDown.show();          btn_RA_volUp.show();
                btn_RA_prevSta.show();   btn_RA_nextSta.show();          btn_RA_staList.show();
                _timeCounter.timer = 5;
                _timeCounter.factor = 2.0;
            }
            if(_radioSubmenue == 2){
                clearVolBar();
                btn_RA_player.show();    btn_RA_dlna.show();             btn_RA_clock.show();
                btn_RA_sleep.show();     btn_RA_bright.show(!_f_brightnessIsChangeable); btn_RA_equal.show();
                btn_RA_bt.show(!_f_BtEmitterFound);
                _timeCounter.timer = 5;
                _timeCounter.factor = 2.0;
            }
            if(_state != RADIO) webSrv.send("changeState=", "RADIO");
            break;
        }

