schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
        case STATIONSLIST:{
            clearWithOutHeaderFooter();
            lst_RADIO.show();
            _timeCounter.timer = 10;
            _timeCounter.factor = 1.0;
            break;
        }

        case PLAYER: {
            if(_state != PLAYER) clearWithOutHeaderFooter();
            if(_playerSubmenue == 0){
                _SD_content.listDir(_curAudioFolder, true, true);
                _cur_Codec = 0;
                showFileLogo(PLAYER);
                showFileName(_SD_content.getIndex(_cur_AudioFileNr));
                showAudioFileNumber();
                if(_state != PLAYER) webSrv.send("changeState=", "PLAYER");
                showAudioFileNumber();
                btn_PL_prevFile.show(); btn_PL_nextFile.show(); btn_PL_ready.show(); btn_PL_playAll.show(); btn_PL_shuffle.show(); btn_PL_fileList.show(); btn_PL_radio.show();
            }
            if(_playerSubmenue == 1){
                btn_PL_Mute.show(); btn_PL_volDown.show(); btn_PL_volUp.show(); btn_PL_pause.setOff(); btn_PL_pause.show(); btn_PL_cancel.show();
            }
            break;
        }
        case AUDIOFILESLIST: {
            clearWithOutHeaderFooter();
            lst_PLAYER.show();
            _timeCounter.timer = 10;
            _timeCounter.factor = 1.0;
            break;
        }
        case DLNA:{
            clearWithOutHeaderFooter();
            showFileLogo(state);
            showVolumeBar();
            btn_DL_Mute.show();    btn_DL_volDown.show();  btn_DL_volUp.show();    btn_DL_pause.show();   btn_DL_cancel.show(); btn_DL_fileList.show(); btn_DL_radio.show();
            break;
        }
        case DLNAITEMSLIST:{
            lst_DLNA.show(_currDLNAsrvNr, dlna.getServer(), dlna.getBrowseResult(), &_dlnaLevel, _dlnaMaxItems);
            _timeCounter.timer = 10;
            _timeCounter.factor = 1.0;
            break;
        }
        case CLOCK:{
            if(_clockSubMenue == 0){
                _timeCounter.timer = 0;
                if(_state != CLOCK){
                    clearWithOutHeaderFooter();
                    clk_CL_green.updateTime(rtc.getMinuteOfTheDay(), rtc.getweekday());
                }
                else{
                    btn_CL_Mute.hide();     btn_CL_alarm.hide();    btn_CL_radio.hide();    btn_CL_volDown.hide(); btn_CL_volUp.hide();
                    clearVolBar();
                }
                clk_CL_green.show();
            }
            if(_clockSubMenue == 1){
                btn_CL_Mute.show();     btn_CL_alarm.show();    btn_CL_radio.show();    btn_CL_volDown.show(); btn_CL_volUp.show();
                _timeCounter.timer = 5;
                _timeCounter.factor = 2.0;
            }
            break;
        }
        case ALARM:{
            clearWithOutHeaderFooter();
            clk_AL_red.show();          btn_AL_left.show();     btn_AL_right.show();    btn_AL_up.show();      btn_AL_down.show();
            btn_AL_ready.show();
            break;
        }
        case SLEEP:{
            clearWithOutHeaderFooter();
            display_sleeptime();
            btn_SL_up.show();           btn_SL_down.show();       btn_SL_ready.show();    btn_SL_cancel.show();
            if(TFT_CONTROLLER < 2) drawImage("/common/Night_Gown.bmp", 198, 23);
            else                   drawImage("/common/Night_Gown.bmp", 280, 45);
            break;
        }
        case BRIGHTNESS:{
            clearWithOutHeaderFooter();
            btn_BR_left.show(); btn_BR_right.show(); btn_BR_ready.show(); pic_BR_logo.show();
            showBrightnessBar();
            break;
        }
        case EQUALIZER:{
            if(_state != EQUALIZER) clearWithOutHeaderFooter();
            sdr_EQ_lowPass.show(); sdr_EQ_bandPass.show(); sdr_EQ_highPass.show(); sdr_EQ_balance.show();
            btn_EQ_lowPass.show(); btn_EQ_bandPass.show(); btn_EQ_highPass.show(); btn_EQ_balance.show(); btn_EQ_Radio.show(); btn_EQ_Player.show(); btn_EQ_Mute.show();
            txt_EQ_lowPass.show(); txt_EQ_bandPass.show(); txt_EQ_highPass.show(); txt_EQ_balance.show();
            break;
        }
        case BLUETOOTH:
            clearWithOutHeaderFooter();
            btn_BL_volUp.show(); btn_BL_volDown.show(); btn_BL_pause.show(); btn_BL_radio.show(); pic_BL_mode.show();
            break;
    }
    _state = state;
}
// clang-format on

/*         ╔═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
           ║                                                                                    L O O P                                                                                  ║
           ╚═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

void loop() {
    if(!_f_ESPfound) return;    // Guard:  wrong chip?
    if(!_f_SD_MMCfound) return; // Guard:  SD_MMC could not be initialisized
    webSrv.loop();
    ir.loop();
    tp.loop();
    ftpSrv.handleFTP();
    ArduinoOTA.handle();
    dlna.loop();
    bt_emitter.loop();

    if(_f_dlnaBrowseServer) {_f_dlnaBrowseServer = false; dlna.browseServer(_currDLNAsrvNr, _dlnaHistory[_dlnaLevel].objId, _totalNumberReturned);}
    if(_f_clearLogo)        {_f_clearLogo = false; clearLogo();}
    if(_f_clearStationName) { _f_clearStationName = false; clearStationName();}

    if(_f_playlistEnabled) {
        if(!_f_playlistNextFile) {
            if(!audioIsRunning() && !_f_pauseResume) {
                SerialPrintfln("AUDIO_info:  " ANSI_ESC_GREEN "next playlist file");
                processPlaylist(false);
                _playlistTime = millis();
                _f_playlistNextFile = true;
            }
        }
        else {
            if(_playlistTime + 5000 < millis()) _f_playlistNextFile = false;
        }
    }

    if(_f_100ms) { // calls every 0.1 second
        _f_100ms = false;
        if(_state == RADIO && _radioSubmenue == 0) VUmeter_RA.update(audioGetVUlevel());
    }

    if(_f_1sec) { // calls every second
        _f_1sec = false;
        const char* time_s = rtc.gettime_s();
        clk_CL_green.updateTime(rtc.getMinuteOfTheDay(), rtc.getweekday());

        //------------------------------------------ALARM MANAGEMENT----------------------------------------------------------------------------------
        {
            if(!_semaphore) { _f_alarm = clk_CL_green.isAlarm(_alarmdays, _alarmtime); }
            if(_f_alarm)         {_semaphore++;}
            if(_semaphore)       {_semaphore++;}
            if(_semaphore >= 65) { _semaphore = 0;}
            if(_f_alarm) {
                _f_alarm = false;
                clearAll();
                dispHeader.updateItem("ALARM");
                dispHeader.updateTime(rtc.gettime_s());
                showFooter();
                showFileName("ALARM");
                drawImage("/common/Alarm.jpg", _winLogo.x, _winLogo.y);
                setTFTbrightness(_brightness);
                SerialPrintfln(ANSI_ESC_MAGENTA "Alarm");
                audioSetVolume(21);
                muteChanged(false);
                connecttoFS("/ring/alarm_clock.mp3");
            }
            if(_f_eof_alarm) { // AFTER RINGING
                _f_eof_alarm = false;
                audioSetVolume(_cur_volume);
                dispHeader.updateVolume(_cur_volume);
                wake_up();
                _radioSubmenue = 0;
                changeState(RADIO);
                connecttohost(_lastconnectedhost.c_str());
                showLogoAndStationName();
            }
        }
        //------------------------------------------1SEC ROUTINE--------------------------------------------------------------------------------------
        if(!_f_sleeping) {
            dispHeader.updateTime(rtc.gettime_s(), false);
            showFooterRSSI(true);
            if(_f_newBitRate) {
               _f_newBitRate = false; }
               showFooterBitRate(_icyBitRate);
            if(_f_newLogoAndStation) {
                _f_newLogoAndStation = false;
                showLogoAndStationName();
            }
        }
        //------------------------------------------STATE TIMEOUT-------------------------------------------------------------------------------------
        if(_timeCounter.timer) {
        //    log_w("timeCounter.timer  %i", _timeCounter.timer);
            _timeCounter.timer--;
            if(_timeCounter.timer < 10) {
                sprintf(_chbuf, "/common/tc%02d.bmp", uint8_t(_timeCounter.timer * _timeCounter.factor));
                drawImage(_chbuf, _winRSSID.x, _winRSSID.y + 2);
            }
            if(!_timeCounter.timer) {
                showFooterRSSI(true);
                if(_state == RADIO) {
                    _radioSubmenue = 0;
                    changeState(RADIO);
                }
                else if(_state == CLOCK) {
                    _clockSubMenue = 0;
                    changeState(CLOCK);
                }
                //    else if(_state == RADIO && _f_switchToClock) { changeState(CLOCK); _f_switchToClock = false; }
                else if(_state == STATIONSLIST) { changeState(RADIO); }
                else if(_state == AUDIOFILESLIST) { changeState(PLAYER); }
                else if(_state == DLNAITEMSLIST) { changeState(DLNA); }
                else { ; } // all other, do nothing
            }
        }
        //---------------------------------------------TIME SPEECH -----------------------------------------------------------------------------------
        if((_f_mute == false) && (!_f_sleeping)) {
            static bool f_resume = false;
            if(endsWith(time_s, "59:53") && _state == RADIO) { // speech the time 7 sec before a new hour is arrived
                int hour = atoi(time_s);                       //  extract the hour
                hour++;
                if(hour == 24) hour = 0;
                if(_f_timeAnnouncement) {
                    f_resume = true;
                    _f_eof = false;
                    if(_timeFormat == 12)
                        if(hour > 12) hour -= 12;
                    sprintf(_chbuf, "/voice_time/%d_00.mp3", hour);
                    SerialPrintfln("Time: ...... play Audiofile %s", _chbuf) connecttoFS(_chbuf);
                    return;
                }
                else { SerialPrintfln("Time: ...... Announcement at %d o'clock is silent", hour); }
            }
            if(f_resume && _f_eof){
                f_resume = false;
                _f_eof = false;
                connecttohost(_lastconnectedhost.c_str());
            }
        }
        //------------------------------------------HEADPHONE / LOUDSPEAKER --------------------------------------------------------------------------
        if(_f_hpChanged) {
            setVolume(_cur_volume);
            if(!digitalRead(HP_DETECT)) { SerialPrintfln("Headphone plugged in"); }
            else { SerialPrintfln("Headphone unplugged"); }
            _f_hpChanged = false;
        }
        //------------------------------------------AUDIO_CURRENT_TIME - DURATION---------------------------------------------------------------------
        if(audioIsRunning() && _f_isFSConnected) {
            _audioCurrentTime = audioGetCurrentTime();
            _audioFileDuration = audioGetFileDuration();
            if(_audioFileDuration) {
                SerialPrintfcr("AUDIO_FILE:  " ANSI_ESC_GREEN "AudioCurrentTime " ANSI_ESC_GREEN "%li:%02lis, " ANSI_ESC_GREEN "AudioFileDuration " ANSI_ESC_GREEN "%li:%02lis",
                               (long int)_audioCurrentTime / 60, (long int)_audioCurrentTime % 60, (long int)_audioFileDuration / 60, (long int)_audioFileDuration % 60);
            }
        }
        //------------------------------------------NEW STREAMTITLE-----------------------------------------------------------------------------------
        if(_f_newStreamTitle && !_timeCounter.timer) {
            _f_newStreamTitle = false;
            if(_state == RADIO) {
                if(strlen(_streamTitle)) showStreamTitle(_streamTitle);
                else if(strlen(_icyDescription)) {
                    showStreamTitle(_icyDescription);
                    _f_newIcyDescription = false;
                    webSrv.send("icy_description=", _icyDescription);
                }
                else clearStreamTitle();
            }
            webSrv.send("streamtitle=", _streamTitle);
        }
        //------------------------------------------NEW ICY-DESCRIPTION-------------------------------------------------------------------------------
        if(_f_newIcyDescription && !_timeCounter.timer) {
            if(_state == RADIO) {
                if(!strlen(_streamTitle)) showStreamTitle(_icyDescription);
            }
            webSrv.send("icy_description=", _icyDescription);
            _f_newIcyDescription = false;
        }
        //------------------------------------------NEW COMMERCIALS-----------------------------------------------------------------------------------
        if(_f_newCommercial && !_timeCounter.timer) {
            if(_state == RADIO) { showStreamTitle(_commercial); }
            webSrv.send("streamtitle=", _commercial);
            _f_newCommercial = false;
        }
        //------------------------------------------END OF COMMERCIALS--------------------------------------------------------------------------------
        if(_commercial_dur > 0) {
            _commercial_dur--;
            if((_commercial_dur == 2) && (_state == RADIO)) clearStreamTitle(); // end of commercial? clear streamtitle
        }
        //------------------------------------------DETERMINE AUDIOCODEC------------------------------------------------------------------------------
        if(_cur_Codec == 0) {
            uint8_t c = audioGetCodec();
            if(c != 0 && c != 8 && c < 10) { // unknown or OGG, guard: c {1 ... 7, 9}
                _cur_Codec = c;
                SerialPrintfln("Audiocodec:  " ANSI_ESC_YELLOW "%s", codecname[c]);
                if(_state == PLAYER) showFileLogo(PLAYER);
                if(_state == RADIO && _f_logoUnknown == true) {
                    _f_logoUnknown = false;
                    showFileLogo(_state);
                }
            }
        }
        //------------------------------------------RECONNECT AFTER FAIL------------------------------------------------------------------------------
        if(_f_reconnect){
            _f_reconnect = false;
            _reconnectCnt ++;
            if(_reconnectCnt < 3) connecttohost(_lastconnectedhost.c_str());
        }
        //------------------------------------------SEEK DLNA SERVER----------------------------------------------------------------------------------
        if(_f_dlnaSeekServer) {
            _f_dlnaSeekServer = false;
            dlna.seekServer();
        }
        //------------------------------------------GET AUDIO FILE ITEMS------------------------------------------------------------------------------
        if(_f_isFSConnected) {
            //    uint32_t t = 0;
            //    uint32_t fs = audioGetFileSize();
            //    uint32_t br = audioGetBitRate();
            //    if(br) t = (fs * 8)/ br;
            //    log_w("Br %d, Dur %ds", br, t);
        }
    } //  END _f_1sec


    if(_f_10sec == true) { // calls every 10 seconds
        _f_10sec = false;
        if(_state == RADIO && !_icyBitRate && !_f_sleeping) {
            uint32_t ibr = audioGetBitRate() / 1000;
            if(ibr > 0) {
                if(ibr != _avrBitRate) {
                    _avrBitRate = ibr;
                    showFooterBitRate(_avrBitRate);
                }
            }
        }
        updateSettings();
    }

    if(_f_1min == true) {  // calls every minute
        _f_1min = false;
        updateSleepTime();
    }

