schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    if(request.startsWith("------")) return;     // uninteresting WebKitFormBoundaryString
    if(request.indexOf("form-data") > 0) return; // uninteresting Info
    if(request == "fileUpload") {
        savefile(_filename.c_str(), contentLength);
        return;
    }
    if(request.startsWith("Content")) return; // suppress Content-Disposition and Content-Type

    SerialPrintfln(ANSI_ESC_RED "unknown request: %s", request.c_str());
}
void WEBSRV_onInfo(const char* info) {
    if(startsWith(info, "WebSocket")) return;      // suppress WebSocket client available
    if(!strcmp("ping", info)) return;              // suppress ping
    if(!strcmp("to_listen", info)) return;         // suppress to_isten
    if(startsWith(info, "Command client")) return; // suppress Command client available
    if(startsWith(info, "Content-D")) return;      // Content-Disposition
    if(CORE_DEBUG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG) {
        SerialPrintfln("HTML_info:   " ANSI_ESC_YELLOW "\"%s\"", info); // infos for debug
    }
}
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
//  Events from DLNA
void dlna_info(const char* info) {
    if(endsWith(info, "is not responding after request")) { // timeout
        _f_dlnaBrowseServer = false;
        if(_dlnaLevel > 0) _dlnaLevel--;
        lst_DLNA.show(_dlnaItemNr, dlna.getServer(), dlna.getBrowseResult(), &_dlnaLevel, _dlnaMaxItems);
        _timeCounter.timer = 10;
        _timeCounter.factor = 1.0;
    }
    SerialPrintfln("DLNA_info:    %s", info);
}

void dlna_server(uint8_t serverId, const char* IP_addr, uint16_t port, const char* friendlyName, const char* controlURL) {
    SerialPrintfln("DLNA_server: [%d] " ANSI_ESC_CYAN "%s:%d " ANSI_ESC_YELLOW " %s", serverId, IP_addr, port, friendlyName);
}

void dlna_seekReady(uint8_t numberOfServer) { SerialPrintfln("DLNA_server: %i media server found", numberOfServer); }

void dlna_browseResult(const char* objectId, const char* parentId, uint16_t childCount, const char* title, bool isAudio, uint32_t itemSize, const char* duration, const char* itemURL) {
    SerialPrintfln("DLNA_server: " ANSI_ESC_YELLOW "title %s, childCount %d, itemSize %ld, duration %s", title, childCount, (long unsigned int)itemSize, duration);
}

void dlna_browseReady(uint16_t numberReturned, uint16_t totalMatches) {
    SerialPrintfln("DLNA_server: returned %i from %i", numberReturned + _totalNumberReturned, totalMatches);
    _dlnaMaxItems = totalMatches;
    if(numberReturned == 50) { // next round
        _totalNumberReturned += numberReturned;
        if(_totalNumberReturned < totalMatches && _totalNumberReturned < 500) { _f_dlnaBrowseServer = true; }
    }
    if(_f_dlnaWaitForResponse) {
        _f_dlnaWaitForResponse = false;
        lst_DLNA.show(_dlnaItemNr, dlna.getServer(), dlna.getBrowseResult(), &_dlnaLevel, _dlnaMaxItems);
        _timeCounter.timer = 10;
        _timeCounter.factor = 1.0;
    }
    else { webSrv.send("dlnaContent=", dlna.stringifyContent()); }
}
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void kcx_bt_info(const char* info, const char* val) {
    if(endsWith(info, "Emitter found")) _f_BtEmitterFound = true;
    SerialPrintfln("BT-Emitter:  %s " ANSI_ESC_YELLOW "%s", info, val);
}

void kcx_bt_status(bool status) { // is always called when the status changes fron disconnected to connected and vice versa
    if(status) {
        const char* mode = bt_emitter.getMode();
        webSrv.send("KCX_BT_connected=", "1");
        if(strcmp(mode, "TX") == 0) pic_BL_mode.setPicturePath("/common/BTgold.jpg");
        else                        pic_BL_mode.setPicturePath("/common/BTblue.jpg");
    }
    else {
        webSrv.send("KCX_BT_connected=", "0");
        pic_BL_mode.setPicturePath("/common/BTnc.jpg");
    }
    if(_state == BLUETOOTH) pic_BL_mode.show();
}

void kcx_bt_memItems(const char* jsonItems) { // Every time an item (name or address) was added, a JSON string is passed here
    // SerialPrintfln("bt_memItems %s", jsonItems);
    webSrv.send("KCX_BT_MEM=", jsonItems);
}

void kcx_bt_scanItems(const char* jsonItems) { // Every time an item (name and address) was scanned, a JSON string is passed here
    // SerialPrintfln("bt_scanItems %s", jsonItems);
    webSrv.send("KCX_BT_SCANNED=", jsonItems);
}

void kcx_bt_modeChanged(const char* m) { // Every time the mode has changed
    if(strcmp("RX", m) == 0) {
        webSrv.send("KCX_BT_MODE=RX");
        log_w("RX");
    }
    if(strcmp("TX", m) == 0) {
        webSrv.send("KCX_BT_MODE=TX");
        log_w("TX");
    }
}
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// clang-format off
void graphicObjects_OnChange(const char* name, int32_t arg1) {
    char c[10];
    if(strcmp(name, "sdr_E_LP") == 0)  {itoa(arg1, c, 10); strcat(c, " dB"); txt_EQ_lowPass.writeText(c);  _toneLP = arg1;  webSrv.send("settone=", setI2STone()); return;}
    if(strcmp(name, "sdr_E_BP") == 0)  {itoa(arg1, c, 10); strcat(c, " dB"); txt_EQ_bandPass.writeText(c); _toneBP = arg1;  webSrv.send("settone=", setI2STone()); return;}
    if(strcmp(name, "sdr_E_HP") == 0)  {itoa(arg1, c, 10); strcat(c, " dB"); txt_EQ_highPass.writeText(c); _toneHP = arg1;  webSrv.send("settone=", setI2STone()); return;}
    if(strcmp(name, "sdr_E_BAL") == 0) {itoa(arg1, c, 10); strcat(c, " ");   txt_EQ_balance.writeText(c);  _toneBAL = arg1; webSrv.send("settone=", setI2STone()); return;}

    log_d("unused event: graphicObject %s was changed, val %li", name, arg1);
}
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void graphicObjects_OnClick(const char* name, uint8_t val) { // val = 0 --> is deactive
    if(_state == RADIO) {
        if( val && strcmp(name, "btn_RA_Mute") == 0)    {_timeCounter.timer = 5; _timeCounter.factor = 2.0; {if(!_f_mute) _f_muteIsPressed = true;} return;}
        if( val && strcmp(name, "btn_RA_volDown") == 0) {_timeCounter.timer = 5; _timeCounter.factor = 2.0; return;}
        if( val && strcmp(name, "btn_RA_volUp") == 0)   {_timeCounter.timer = 5; _timeCounter.factor = 2.0; return;}
        if( val && strcmp(name, "btn_RA_prevSta") == 0) {clearVolBar();          return;}
        if( val && strcmp(name, "btn_RA_nextSta") == 0) {clearVolBar();          return;}
        if( val && strcmp(name, "btn_RA_staList") == 0) {return;}
        if( val && strcmp(name, "btn_RA_player") == 0)  {return;}
        if( val && strcmp(name, "btn_RA_dlna") == 0)    {return;}
        if( val && strcmp(name, "btn_RA_clock") == 0)   {return;}
        if( val && strcmp(name, "btn_RA_sleep") == 0)   {return;}
        if( val && strcmp(name, "btn_RA_bright") == 0)  {return;}
        if(!val && strcmp(name, "btn_RA_bright") == 0)  {_timeCounter.timer = 5; _timeCounter.factor = 2.0; return;}
        if( val && strcmp(name, "btn_RA_equal") == 0)   {return;}
        if( val && strcmp(name, "btn_RA_bt") == 0)      {return;}
        if(!val && strcmp(name, "btn_RA_bt") == 0)      {_timeCounter.timer = 5; _timeCounter.factor = 2.0; return;}
        if( val && strcmp(name, "VUmeter_RA") == 0)     {return;}
    }
    if(_state == STATIONSLIST) {
        if( val && strcmp(name, "lst_RADIO") == 0)      {_timeCounter.timer = 10; _timeCounter.factor = 1.0; return;}
    }
    if(_state == PLAYER) {
        if( val && strcmp(name, "btn_PL_Mute") == 0)    {{if(!_f_mute) _f_muteIsPressed = true;} return;}
        if( val && strcmp(name, "btn_PL_volDown") == 0) {return;}
        if( val && strcmp(name, "btn_PL_volUp") == 0)   {return;}
        if( val && strcmp(name, "btn_PL_pause") == 0)   {return;}
        if( val && strcmp(name, "btn_PL_cancel") == 0)  {return;}
        if( val && strcmp(name, "btn_PL_prevFile") == 0){if(_cur_AudioFileNr > 0) {_cur_AudioFileNr--; showFileName(_SD_content.getIndex(_cur_AudioFileNr)); showAudioFileNumber();} return;}
        if( val && strcmp(name, "btn_PL_nextFile") == 0){if(_cur_AudioFileNr + 1 < _SD_content.getSize()) {_cur_AudioFileNr++; showFileName(_SD_content.getIndex(_cur_AudioFileNr)); showAudioFileNumber();} return;}
        if( val && strcmp(name, "btn_PL_ready") == 0)   {return;}
        if( val && strcmp(name, "btn_PL_playAll") == 0) {return;}
        if( val && strcmp(name, "btn_PL_shuffle") == 0) {return;}
        if( val && strcmp(name, "btn_PL_fileList") == 0){return;}
        if( val && strcmp(name, "btn_PL_radio") == 0)   {return;}
    }
    if(_state == AUDIOFILESLIST) {
        if( val && strcmp(name, "lst_PLAYER") == 0)     {_timeCounter.timer = 10; _timeCounter.factor = 1.0; return;}
    }
    if(_state == DLNA) {
        if( val && strcmp(name, "btn_DL_Mute") == 0)    {{if(!_f_mute) _f_muteIsPressed = true;} return;}
        if( val && strcmp(name, "btn_DL_pause") == 0)   {return;}
        if( val && strcmp(name, "btn_DL_volDown") == 0) {return;}
        if( val && strcmp(name, "btn_DL_volUp") == 0)   {return;}
        if( val && strcmp(name, "btn_DL_radio") == 0)   {return;}
        if( val && strcmp(name, "btn_DL_fileList") == 0){return;}
        if( val && strcmp(name, "btn_DL_cancel") == 0)  {clearStationName(); btn_DL_pause.setInactive(); return;}
    }
    if(_state == DLNAITEMSLIST) {
        if( val && strcmp(name, "lst_DLNA") == 0)       {_f_dlnaWaitForResponse = true; return;}
    }
    if(_state == CLOCK) {
        if( val && strcmp(name, "btn_CL_Mute") == 0)    {_timeCounter.timer = 5; _timeCounter.factor = 2.0; if(!_f_mute){ _f_muteIsPressed = true;} return;}
        if( val && strcmp(name, "btn_CL_alarm") == 0)   {return;}
        if( val && strcmp(name, "btn_CL_radio") == 0)   {return;}
        if( val && strcmp(name, "btn_CL_volDown") == 0) {_timeCounter.timer = 5; _timeCounter.factor = 2.0; return;}
        if( val && strcmp(name, "btn_CL_volUp") == 0)   {_timeCounter.timer = 5; _timeCounter.factor = 2.0; return;}
        if( val && strcmp(name, "clk_CL_green") == 0)   {return;}
    }
    if(_state == ALARM) {
        if( val && strcmp(name, "clk_AL_red") == 0)     {return;}
        if( val && strcmp(name, "btn_AL_left") == 0)    {return;}
        if( val && strcmp(name, "btn_AL_right") == 0)   {return;}
        if( val && strcmp(name, "btn_AL_up") == 0)      {return;}
        if( val && strcmp(name, "btn_AL_down") == 0)    {return;}
        if( val && strcmp(name, "btn_AL_ready") == 0)   {return;}
    }
    if(_state == SLEEP) {
        if( val && strcmp(name, "btn_SL_up") == 0)      {return;}
        if( val && strcmp(name, "btn_SL_down") == 0)    {return;}
        if( val && strcmp(name, "btn_SL_ready") == 0)   {return;}
        if( val && strcmp(name, "btn_SL_cancel") == 0)  {return;}
    }
    if(_state == BRIGHTNESS){
        if( val && strcmp(name, "btn_BR_left") == 0)    {return;}
        if( val && strcmp(name, "btn_BR_right") == 0)   {return;}
        if( val && strcmp(name, "btn_BR_ready") == 0)   {return;}
        if( val && strcmp(name, "pic_BR_logo") == 0)    {return;}
    }
    if(_state == EQUALIZER) {
        if( val && strcmp(name, "btn_E_LP") == 0)       {sdr_EQ_lowPass.setValue(0);  return;}
        if( val && strcmp(name, "btn_E_BP") == 0)       {sdr_EQ_bandPass.setValue(0); return;}
        if( val && strcmp(name, "btn_E_HP") == 0)       {sdr_EQ_highPass.setValue(0); return;}
        if( val && strcmp(name, "btn_E_BAL") == 0)      {sdr_EQ_balance.setValue(0);  return;}
        if( val && strcmp(name, "btn_EQ_Radio") == 0)   {return;}
        if( val && strcmp(name, "btn_EQ_Player") == 0)  {return;}
        if( val && strcmp(name, "btn_EQ_Mute") == 0)    {{if(!_f_mute) _f_muteIsPressed = true;} return;}
    }
    if(_state == BLUETOOTH) {
        if( val && strcmp(name, "btn_BL_pause") == 0)   {bt_emitter.pauseResume(); return;}
        if( val && strcmp(name, "btn_BL_radio") == 0)   {return;}
        if( val && strcmp(name, "btn_BL_volDown") == 0) {bt_emitter.downvolume(); return;}
        if( val && strcmp(name, "btn_BL_volUp") == 0)   {bt_emitter.upvolume(); return;}
    }
    log_d("unused event: graphicObject %s was clicked", name);
}
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void graphicObjects_OnRelease(const char* name, releasedArg ra) {

