schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    if(_state == RADIO) {
        if(strcmp(name, "btn_RA_Mute") == 0)     {muteChanged(btn_RA_Mute.getValue()); return;}
        if(strcmp(name, "btn_RA_volDown") == 0)  {downvolume(); showVolumeBar(); return;}
        if(strcmp(name, "btn_RA_volUp") == 0)    {upvolume(); showVolumeBar(); return;}
        if(strcmp(name, "btn_RA_prevSta") == 0)  {_radioSubmenue = 0; prevStation(); showFooterStaNr(); return;}
        if(strcmp(name, "btn_RA_nextSta") == 0)  {_radioSubmenue = 0; nextStation(); showFooterStaNr(); return;}
        if(strcmp(name, "btn_RA_staList") == 0)  {_radioSubmenue = 0; changeState(STATIONSLIST); return;}
        if(strcmp(name, "btn_RA_player") == 0)   {_radioSubmenue = 0; stopSong(); changeState(PLAYER); return;}
        if(strcmp(name, "btn_RA_dlna") == 0)     {_radioSubmenue = 0; stopSong(); changeState(DLNA); return;}
        if(strcmp(name, "btn_RA_clock") == 0)    {_radioSubmenue = 0; changeState(CLOCK); return;}
        if(strcmp(name, "btn_RA_sleep") == 0)    {_radioSubmenue = 0; changeState(SLEEP); return;}
        if(strcmp(name, "btn_RA_bright") == 0)   {_radioSubmenue = 0; changeState(BRIGHTNESS); return;}
        if(strcmp(name, "btn_RA_equal") == 0)    {_radioSubmenue = 0; changeState(EQUALIZER); return;}
        if(strcmp(name, "btn_RA_equal") == 0)    {_radioSubmenue = 0; changeState(EQUALIZER); return;}
        if(strcmp(name, "btn_RA_bt") == 0)       {_radioSubmenue = 0; changeState(BLUETOOTH); return;}
        if(strcmp(name, "VUmeter_RA") == 0)      {return;}
    }
    if(_state == STATIONSLIST) {
        if(strcmp(name, "lst_RADIO") == 0)       {if(ra.val1){_radioSubmenue = 0; setStation(ra.val1); changeState(RADIO);} return;}
    }
    if(_state == PLAYER) {
        if(strcmp(name, "btn_PL_Mute") == 0)     {muteChanged(btn_PL_Mute.getValue()); return;}
        if(strcmp(name, "btn_PL_volDown") == 0)  {downvolume(); showVolumeBar(); return;}
        if(strcmp(name, "btn_PL_volUp") == 0)    {upvolume(); showVolumeBar(); return;}
        if(strcmp(name, "btn_PL_pause") == 0)    {if(_f_isFSConnected) {audioPauseResume();} return;}
        if(strcmp(name, "btn_PL_cancel") == 0)   {_playerSubmenue = 0; stopSong(); changeState(PLAYER); return;}
        if(strcmp(name, "btn_PL_prevFile") == 0) {return;}
        if(strcmp(name, "btn_PL_nextFile") == 0) {return;}
        if(strcmp(name, "btn_PL_ready") == 0)    {_playerSubmenue = 1; SD_playFile(_curAudioFolder, _SD_content.getIndex(_cur_AudioFileNr)); changeState(PLAYER); showAudioFileNumber(); return;}
        if(strcmp(name, "btn_PL_playAll") == 0)  {_playerSubmenue = 1; _f_shuffle = false; preparePlaylistFromFolder(_curAudioFolder); processPlaylist(true); changeState(PLAYER); return;}
        if(strcmp(name, "btn_PL_shuffle") == 0)  {_playerSubmenue = 1; _f_shuffle = true; preparePlaylistFromFolder(_curAudioFolder); processPlaylist(true); changeState(PLAYER); return;}
        if(strcmp(name, "btn_PL_fileList") == 0) {_playerSubmenue = 1; _SD_content.listDir(_curAudioFolder, true, false); changeState(AUDIOFILESLIST); return;}
        if(strcmp(name, "btn_PL_radio") == 0)    {_playerSubmenue = 0; setStation(_cur_station); changeState(RADIO); return;}
    }
    if(_state == AUDIOFILESLIST){
        if(strcmp(name, "lst_PLAYER") == 0)      {if(ra.val1 == 1){lst_PLAYER.show();} if(ra.val1 == 2){SD_playFile(ra.arg1);} return;}
    }
    if(_state == DLNA) {
        if(strcmp(name, "btn_DL_Mute") == 0)     {muteChanged(btn_DL_Mute.getValue()); return;}
        if(strcmp(name, "btn_DL_pause") == 0)    {audioPauseResume(); return;}
        if(strcmp(name, "btn_DL_volDown") == 0)  {downvolume(); showVolumeBar(); return;}
        if(strcmp(name, "btn_DL_volUp") == 0)    {upvolume(); showVolumeBar(); return;}
        if(strcmp(name, "btn_DL_radio") == 0)    {setStation(_cur_station); changeState(RADIO); return;}
        if(strcmp(name, "btn_DL_fileList") == 0) {changeState(DLNAITEMSLIST); return;}
        if(strcmp(name, "btn_DL_cancel") == 0)   {stopSong(); return;}
    }
    if(_state == DLNAITEMSLIST) {
        if(strcmp(name, "lst_DLNA") == 0)        {if(ra.val1){changeState(DLNA); connecttohost(ra.arg1); showFileName(ra.arg2);} return;}
    }
    if(_state == CLOCK) {
        if(strcmp(name, "btn_CL_Mute") == 0)     {muteChanged(btn_CL_Mute.getValue()); return;}
        if(strcmp(name, "btn_CL_alarm") == 0)    {changeState(ALARM); return;}
        if(strcmp(name, "btn_CL_radio") == 0)    {_clockSubMenue = 0; changeState(RADIO); return;}
        if(strcmp(name, "btn_CL_volDown") == 0)  {downvolume(); showVolumeBar(); return;}
        if(strcmp(name, "btn_CL_volUp") == 0)    {upvolume(); showVolumeBar(); return;}
        if(strcmp(name, "clk_CL_green") == 0)    {_clockSubMenue = 1; changeState(CLOCK); return;}
    }
    if(_state == ALARM) {
        if(strcmp(name, "clk_AL_red") == 0)      {return;}
        if(strcmp(name, "btn_AL_left") == 0)     {clk_AL_red.shiftLeft(); return;}
        if(strcmp(name, "btn_AL_right") == 0)    {clk_AL_red.shiftRight(); return;}
        if(strcmp(name, "btn_AL_up") == 0)       {clk_AL_red.digitUp(); return;}
        if(strcmp(name, "btn_AL_down") == 0)     {clk_AL_red.digitDown(); return;}
        if(strcmp(name, "btn_AL_ready") == 0)    {updateSettings(); _clockSubMenue = 0; changeState(CLOCK); logAlarmItems(); return;}
    }
    if(_state == SLEEP) {
        if(strcmp(name, "btn_SL_up") == 0)       {display_sleeptime(1); return;}
        if(strcmp(name, "btn_SL_down") == 0)     {display_sleeptime(-1); return;}
        if(strcmp(name, "btn_SL_ready") == 0)    {updateSleepTime(true); changeState(RADIO); return;}
        if(strcmp(name, "btn_SL_cancel") == 0)   {changeState(RADIO); return;}
    }
    if(_state == BRIGHTNESS){
        if(strcmp(name, "btn_BR_left") == 0)     {downBrightness(); return;}
        if(strcmp(name, "btn_BR_right") == 0)    {upBrightness(); return;}
        if(strcmp(name, "btn_BR_ready") == 0)    {changeState(RADIO); return;}
        if(strcmp(name, "pic_BR_logo") == 0)     {return;}
    }
    if(_state == EQUALIZER) {
        if(strcmp(name, "btn_EQ_Radio") == 0)    {setStation(_cur_station); changeState(RADIO); return;}
        if(strcmp(name, "btn_EQ_Player") == 0)   {changeState(PLAYER); return;}
        if(strcmp(name, "btn_EQ_Mute") == 0)     {muteChanged(btn_EQ_Mute.getValue()); return;}
    }
    if(_state == BLUETOOTH) {
        if(strcmp(name, "btn_BL_pause") == 0)    {return;}
        if(strcmp(name, "btn_BL_radio") == 0)    {changeState(RADIO); return;}
        if(strcmp(name, "btn_BL_volDown") == 0)  {return;}
        if(strcmp(name, "btn_BL_volUp") == 0)    {return;}
    }
    log_d("unused event: graphicObject %s was released", name);
}
// clang-format on